In [25]:
import pandas as pd

In [26]:
df = pd.read_csv("titanic.csv")

In [27]:
df.head()

,PassengerId,Name,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [28]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Pclass  Gender   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [30]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [31]:
dummies=pd.get_dummies(inputs.Gender)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [32]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass  Gender   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [33]:
inputs.drop(['Gender','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [36]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [38]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [39]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [50]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [51]:
model.fit(X_train,y_train)

GaussianNB()

In [52]:
model.score(X_test,y_test)

0.7947761194029851

In [53]:
X_test[0:10]

     Pclass        Age      Fare  female
591       1  52.000000   78.2667       1
783       3  29.699118   23.4500       0
884       3  25.000000    7.0500       0
341       1  24.000000  263.0000       1
443       2  28.000000   13.0000       1
209       1  40.000000   31.0000       0
141       3  22.000000    7.7500       1
741       1  36.000000   78.8500       0
763       1  36.000000  120.0000       1
836       3  21.000000    8.6625       0

In [54]:
y_test[0:10]

591    1
783    0
884    0
341    1
443    1
209    1
141    1
741    0
763    1
836    0
Name: Survived, dtype: int64

In [55]:
model.predict(X_test[0:10])

array([1, 0, 0, 1, 1, 0, 1, 1, 1, 0], dtype=int64)

In [56]:
model.predict_proba(X_test[:10])

array([[2.08032243e-02, 9.79196776e-01],
       [9.61064237e-01, 3.89357630e-02],
       [9.59373646e-01, 4.06263536e-02],
       [1.60130481e-12, 1.00000000e+00],
       [2.73479340e-01, 7.26520660e-01],
       [7.72785267e-01, 2.27214733e-01],
       [4.23604880e-01, 5.76395120e-01],
       [4.14231842e-01, 5.85768158e-01],
       [1.36084052e-03, 9.98639159e-01],
       [9.56931565e-01, 4.30684355e-02]])